In [2]:
import pandas as pd

In [3]:
Character_Name = pd.Series(["Michael Scofield", "Lincoln Burrows","Theodore Bagwell","Brad Bellick","Sara Tancredi"])
Character_Name

0    Michael Scofield
1     Lincoln Burrows
2    Theodore Bagwell
3        Brad Bellick
4       Sara Tancredi
dtype: object

In [4]:
Character_Real_Life_Name = pd.Series(["Wentworth Miller", "Dominic Purcell","Robert Knepper","Wade Williams","Sarah Wayne Callies"])
Character_Real_Life_Name

0       Wentworth Miller
1        Dominic Purcell
2         Robert Knepper
3          Wade Williams
4    Sarah Wayne Callies
dtype: object

In [5]:
Character_Age = pd.Series([51, 53,64,61,46])
Character_Age

0    51
1    53
2    64
3    61
4    46
dtype: int64

In [6]:
Prison_Break = pd.DataFrame({
    "Character_Name":Character_Name,
    "Character_Real_Life_Name":Character_Real_Life_Name,
    "Character_Age":Character_Age
    
})

In [7]:
Prison_Break

     Character_Name Character_Real_Life_Name  Character_Age
0  Michael Scofield         Wentworth Miller             51
1   Lincoln Burrows          Dominic Purcell             53
2  Theodore Bagwell           Robert Knepper             64
3      Brad Bellick            Wade Williams             61
4     Sara Tancredi      Sarah Wayne Callies             46

In [8]:
Prison_Break.describe()

       Character_Age
count       5.000000
mean       55.000000
std         7.382412
min        46.000000
25%        51.000000
50%        53.000000
75%        61.000000
max        64.000000

In [9]:
Prison_Break.dtypes

Character_Name              object
Character_Real_Life_Name    object
Character_Age                int64
dtype: object

In [10]:
titanic = pd.read_csv("titanic.csv")

In [11]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
titanic.Survived.sum()

342

In [16]:
titanic.groupby(["Pclass"])["Survived"].sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64